{
  "result":[
    {
      "name": "Daniel Anson",
      "role": "Ensemble",
      "school": "Seattle University ",
      "pronouns": "He/Him",
      "location": "",
      "bio": "Daniel Anson (He/Him) is a third year Theater Major at Seattle University. He is from Salt Lake City, Utah, and very excited for further engagement with theatre in Seattle. Previous shows at Seattle University include <em>Three Sisters</em> (Tuzenbach), <em>Marisol</em> (Lenny), and <em>You on the Moors Now</em> (Player 5). He also enjoys costuming and scenic painting. He would like to extend a gracious thank-you to all the student and staff technical pioneers that have worked tirelessly to make these shows possible."

    }, {
      "name": "Mallory Carbon",
      "role": "Ensemble",
      "school": "University of Washington",
      "pronouns": "She/Her",
      "location": "",
      "bio": "Mallory Carbon is a senior at the University of Washington studying Science, Technology, and Society. Originally from Spokane, WA, Mallory is a multidisciplinary creative with passions for astrophysics, musical theater, all things sparkly, and with hopes of changing the world one day. Her favorite past credits include Elle Woods in <em>Legally Blonde</em> and Audrey in <em>Little Shop of Horrors</em>. A big thanks to her fiercely supportive mom, Kari, and her mentor and friend, David for being amazing people and inspiring her work on this project."

    }, {
      "name": "Gabe Fitzpatrick",
      "role": "Ensemble",
      "school": "Cornish College of the Arts",
      "pronouns": "He/Him",
      "location": "",
      "bio": "Gabriel FitzPatrick is a third year Theatre Major with a concentration in Musical Theatre at Cornish College of the Arts. He is from Southern Oregon, but is currently living in Seattle, Washington. He most recently played Rochester in a radio play adaption of <em>You On The Moors Now</em>. He is so excited to be a part of this show alongside some incredible artists! "

    }, {
      "name": "Franco",
      "role": "Ensemble",
      "school": "Cornish College of the Arts",
      "pronouns": "He/Him",
      "location": "",
      "bio": "Franco is a second year Theater major at Cornish College of the Arts. He is from Southern California and moved up to Seattle, WA in 2019 to pursue work as a drag queen and attend college. His former theater work includes the musicals <em>Anything Goes</em>, <em>Zombie Prom</em>, and <em>Legally Blonde</em>, as well as performing in various nightlife venues across Seattle. He is enthusiastic about exploring this new virtual form of performance art!"

    }, {
      "name": "Lily Noto",
      "role": "Ensemble",
      "school": "Seattle University",
      "pronouns": "She/They",
      "location": "",
      "bio": "Lily Noto is a fourth year Theatre and Arts Leadership Major at Seattle University. She is originally from Grass Valley, California, but currently resides in Seattle, Washington. Some of her previous acting experience includes the <em>Misanthrope</em>, <em>You on the Moors Now</em>, and <em>Project 60</em> with Theater Simple. They are grateful for their family for always cheering them on!"

    }, {
      "name": "Leah Sainz-Jones",
      "role": "Ensemble",
      "school": "Cornish College of the Arts",
      "pronouns": "They/Them and She/Her",
      "location": "",
      "bio": "Leah Sainz-Jones is an actor, singer, dancer, and poet living in Seattle, WA and finishing up their BFA in Musical Theatre at Cornish College of the Arts. Their recent credits include Ladislav Sipos in <em>She Loves Me</em> (SecondStory Repertory), Wadsworth in <em>The Fabulous Fable</em> Factory (Theater Schmeater), <em>Xanadu</em> (Cornish College of the Arts), Gwendolyn Rogers in <em>Ghost Party: Remastered </em> (Dacha Theatre), Javi Muleros in <em>Sonnets For An Old Century</em> (Cornish) and W in Danielle Mohlman's <em>NEXUS</em>. They were also slated to be in Danielle Mohlman's DUST (Dacha Theatre), as well as Velma Kelly in CHICAGO (Cornish)--- before COVID hit but they were sadly canceled. Their passion for theatre and performance stems from their passion to connect with people and create more space for empathy in the world. Leah is a proud Native American Latine Chinese artist and performer who hopes to contribute to and create work that is honest, bold, and inclusive. "

    }, {
      "name": "Hannah Saito",
      "role": "Ensemble",
      "school": "University of Washington",
      "pronouns": "She/Her",
      "location": "",
      "bio": "Hannah Saito is a third year at the University of Washington, studying Drama Performance, English (both majors), and Anthropology (minor). She Zooms in from Shoreline, WA. Previous acting experience includes <em>Love and Information</em> (on the Zoom stage), <em>Much Ado About Nothing</em>, and <em>Little Shop of Horrors</em>. She would like to thank her family for dealing with the chaos of in house rehearsals, and the cast for being wonderful collaborators!"

    }, {
      "name": "Sam Vasquez",
      "role": "Ensemble",
      "school": "Cornish College of the Arts",
      "pronouns": "She/Her",
      "location": "",
      "bio": "Sam is a third year Theatre: Original Works major at Cornish College of the Arts. She is from Southern, CA and misses the warm weather. She has previously work on the generative project <em>Between Us</em> and assistant directed <em>Stupid F^*king Bird</em> last semester. She is incredibly grateful to be here and to be making art again. "

    }, {
      "name": "Christie Zhao",
      "role": "Ensemble",
      "school": "University of Washington",
      "pronouns": "She/They",
      "location": "",
      "bio": "Christie Zhao is a fourth year Drama performance and Computer Science major at the University of Washington. She is from her parents but she is very happy to be in Seattle now. She found her passion for theater in college. Since freshman year, she founded the Chinese Theater Club at UW, acted as a lead singer in the Musical <em>Revue In Between</em> and Yiman Zhang in <em>Mr. Donkey</em>, light designed <em>Head Trip: An Improvised Drama</em> and <em>Vietgone</em>, directed a Chinese zoom theater <em>The Good Person of Szechwan</em> and is going to direct a multimedia version of <em>The Good Person</em> in March as her capstone project. She learned a ton in this devising project and she is super grateful to work with Porscha and Sheila and all the amazing cast and crew!"

    }
  ]
}