{
  "result":[
    {
      "name": "Andy Ho",
      "role": "Sir Andrew",
      "school": "Seattle University",
      "pronouns": "He/Him",
      "location": "",
      "bio": "Andy Ho is a third year student at Seattle University, pursuing a double degree in Theatre and Kinesiology. He is a Washington local, born and raised in Auburn, WA. Previous stage credits include Man with scar tissue in <em>Marisol</em> (Seattle University), Basque in <em>The Misanthrope</em> (Seattle University), and Buttons in <em>Newsies</em> (Tacoma Musical Playhouse). He sends all his love to mom, dad, Breanna, and Brendan!"

    }, {

      "name": "Alex Bailey",
      "role": "Feste the Fool",
      "school": "Seattle University",
      "pronouns": "He/Him",
      "location": "",
      "bio": "Alexis (Alex) Bailey is a second year double major in Criminal Justice and Theatre at Seattle University. He is originally from Portland, OR but is currently living on campus in Seattle. His previous productions include <em>45 Plays for 45 Presidents</em> and <em>The Zoom Where it Happens</em>. This will be his second main production at Seattle University and he is delighted to play Feste in <em>Twelfth Night</em>. He is extremely grateful for the opportunity to work with such a wonderful cast and crew from all over the city. He hopes that you enjoy the show!"

    }, {

      "name": "Christopher Edwards",
      "role": "Orsino",
      "school": "Cornish College of the Arts",
      "pronouns": "He/Him",
      "location": "",
      "bio": "Christopher is a senior at Cornish College of the Arts about to earn his BFA with the sole focus of acting. He is currently applying to graduate schools in Los Angeles and New York, and hopes to continue to dive headfirst into his acting work either through further study or experience in the professional world. This will be his 9th full-length performance at the collegiate level, and he would like to thank the entire production team of <em>Twelfth Night</em> for bringing his performance to life in the stubborn medium of zoom. He would also like to take this opportunity to thank all of his family and loved ones for their continual support, positive energy, and patience while he found his place in this world."

    }, {

      "name": "Astrid Fiverson",
      "role": "Sebastian",
      "school": "University of Washington",
      "pronouns": "She/Her",
      "location": "",
      "bio": "Astrid is a second year acting major at the University of Washington. Originally from New Jersey, she now lives in Seattle where she has appeared in shows such as <em>Burning Man</em>, <em>Museum</em>, and <em>The Cherry Orchard</em>. She is thrilled to be a part of this wonderful cast and crew, and is grateful for all the friends and family who supported and encouraged her along the way!"

    }, {


      "name": "Truxton Ivory",
      "role": "Maria/The Captain",
      "school": "Cornish College of the Arts",
      "pronouns": "They/Them",
      "location": "",
      "bio": "Truxton Ivory is a third year Musical Theatre major at Cornish College of the Arts. Originally from Fresno, California, Truxton has gotten to participate in Cornish productions such as <em>Theory of Relativity</em>, and multiple generative projects spanning the course of their education. They are deeply humbled and grateful for the opportunity to create and collaborate with the group of incredible artists and creatives involved in this project! "

    }, {

      "name": "Ariana Moore",
      "role": "Viola",
      "school": "Seattle University",
      "pronouns": "She/Her",
      "location": "",
      "bio": "Ari is a third year theatre and gender/sexuality studies major at Seattle University. She transferred to SU in her second year from Drew University, NJ. Over the last two years, Ari has performed in the directing class scenes, and <em>45 plays for 45 presidents</em>. She is so excited to be acting again this quarter and is grateful for all the hard work everyone has done to make theatre happen this year. "

    }, {

      "name": "Talia Rossi",
      "role": "Malvolio/Officer/Priest",
      "school": "Seattle University",
      "pronouns": "She/Her",
      "location": "",
      "bio": "Talia Rossi is a fourth year Theatre and Psychology double major at Seattle University. She is originally from San Jose, CA but currently resides in Seattle, WA. Her previous acting credits include Masha in <em>Three Sisters</em>, Jane Eyre in <em>You on the Moors Now</em>, and Ally in <em>Interior</em>; a film by Brennan Bunn. Talia is so grateful to be involved in the Uncharted Waters Project and to have the opportunity to make theatre with other Seattle college students. She wants to thank her family and friends for their unconditional love and support throughout her time in college!"

    }, {
    
      "name": "Nora Talaga",
      "role": "Olivia",
      "school": "Seattle University",
      "pronouns": "She/Her",
      "location": "",
      "bio": "Nora Talaga is a fourth year theatre major and Spanish minor at Seattle University. She is from Chicago and is thrilled to be performing in her sixth production at SU. She is grateful for the chance to work with Rosa and Kate again, and she'd like to thank everyone involved in this production for making everyday fun. She would also like to thank her supportive friends and family for having her back throughout this process. "

    }, {

      "name": "Taylor Freeman",
      "role": "Antonia/Valentine",
      "school": "University of Washington",
      "pronouns": "She/Hers",
      "location": "",
      "bio": "Taylor Freeman is a second year Drama: Performance Major at the University of Washington. She is from Dallas, Texas, but has travelled up to Seattle, WA to continue her education and training. Her previous work includes playing the role of Anon in <em>(Anon)ymous</em> and Eurydice in <em>Eurydice</em>. She is very thankful for the amazing team she gets to work with for this production, and for her friends and family who have made her who she is today."

    }, {

      "name": "Cameron Widmark",
      "role": "Sir Toby",
      "school": "Cornish College of the Arts",
      "pronouns": "He/They",
      "location": "",
      "bio": "Cameron Widmark, is currently in his 3rd Year at Cornish College of the Arts. He hails from California, and is pursuing his BFA in Musical Theatre. Over the past few years he's been in <em>The Little Mermaid</em>, <em>Kill Shakespeare</em>, <em>Dick Whittington</em>, <em>All in the Timing</em>, and <em>The Hunchback of Notre Dame</em>. He wishes to thank his amazing faculty, cast, and crew-mates for their invaluable wisdom, patience, and grace in working with him (and for suffering through his terrible Puns). In his free time Cameron enjoys D&D, reading, writing, video games, Runic Lore, and Gladiatorial Combat to the Death on Weekends. So with that, best wishes and enjoy the show!"

    }
  ]
}